---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpatialElementGeometryResults
source: html/5721eb25-a127-cea3-0c96-a2723315756b.htm
---
# SpatialElementGeometryResults Methods

Query the spatial element boundary face information with the given face.